app/Controllers/BaseController.php

SELECT *
FROM `tab_user`
WHERE `email` = 'bagas.aji838@gmail.com'
---
    public function session_login()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('tab_user');

        $data = $builder->getWhere(['email' => $this->session->get('email')])->getRowArray();